Revit 2024 API
CheckoutStatus Enumeration
 Indicates the ownership status of an element
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum CheckoutStatus
Visual Basic
Public Enumeration CheckoutStatus
Visual C++
public enum class CheckoutStatus
Members
Member name | Description
OwnedByCurrentUser |  The element is owned by the current user.
OwnedByOtherUser |  The element is owned by some user other than the current user.
NotOwned |  The element is not owned by any user.
See Also
Autodesk.Revit.DB Namespace